._design_docs/.test_reports/mtp-jinja-run-20260609-V2/S12-MTP-B06-V2-Jmarked/legacy/k6-stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: D:\source\llama.cpp-jet\tools\server\tests\bench-cache-correctness.js
        output: json (D:\source\llama.cpp-jet\._design_docs\.test_reports\mtp-jinja-run-20260609-V2\S12-MTP-B06-V2-Jmarked\legacy\k6-results.json)

     scenarios: (100.00%) 2 scenarios, 2 max VUs, 5m30s max duration (incl. graceful stop):
              * hit_probe: 23 iterations shared among 1 VUs (maxDuration: 5m0s, exec: doProbe, gracefulStop: 30s)
              * warmup: 1 iterations shared among 1 VUs (maxDuration: 2m0s, exec: doWarmup, gracefulStop: 30s)


running (0m01.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
hit_probe   [   0% ] 1 VUs  0m01.0s/5m0s  00/23 shared iters
warmup      [   0% ] 1 VUs  0m01.0s/2m0s  0/1 shared iters

running (0m02.0s), 1/2 VUs, 1 complete and 0 interrupted iterations
hit_probe   [   0% ] 1 VUs  0m02.0s/5m0s  00/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m03.0s), 1/2 VUs, 3 complete and 0 interrupted iterations
hit_probe   [   9% ] 1 VUs  0m03.0s/5m0s  02/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m04.0s), 1/2 VUs, 4 complete and 0 interrupted iterations
hit_probe   [  13% ] 1 VUs  0m04.0s/5m0s  03/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m05.0s), 1/2 VUs, 5 complete and 0 interrupted iterations
hit_probe   [  17% ] 1 VUs  0m05.0s/5m0s  04/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m06.0s), 1/2 VUs, 6 complete and 0 interrupted iterations
hit_probe   [  22% ] 1 VUs  0m06.0s/5m0s  05/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m07.0s), 1/2 VUs, 7 complete and 0 interrupted iterations
hit_probe   [  26% ] 1 VUs  0m07.0s/5m0s  06/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m08.0s), 1/2 VUs, 8 complete and 0 interrupted iterations
hit_probe   [  30% ] 1 VUs  0m08.0s/5m0s  07/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m09.0s), 1/2 VUs, 9 complete and 0 interrupted iterations
hit_probe   [  35% ] 1 VUs  0m09.0s/5m0s  08/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m10.0s), 1/2 VUs, 11 complete and 0 interrupted iterations
hit_probe   [  43% ] 1 VUs  0m10.0s/5m0s  10/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m11.0s), 1/2 VUs, 12 complete and 0 interrupted iterations
hit_probe   [  48% ] 1 VUs  0m11.0s/5m0s  11/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m12.0s), 1/2 VUs, 13 complete and 0 interrupted iterations
hit_probe   [  52% ] 1 VUs  0m12.0s/5m0s  12/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m13.0s), 1/2 VUs, 14 complete and 0 interrupted iterations
hit_probe   [  57% ] 1 VUs  0m13.0s/5m0s  13/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m14.0s), 1/2 VUs, 15 complete and 0 interrupted iterations
hit_probe   [  61% ] 1 VUs  0m14.0s/5m0s  14/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m15.0s), 1/2 VUs, 16 complete and 0 interrupted iterations
hit_probe   [  65% ] 1 VUs  0m15.0s/5m0s  15/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m16.0s), 1/2 VUs, 17 complete and 0 interrupted iterations
hit_probe   [  70% ] 1 VUs  0m16.0s/5m0s  16/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m17.0s), 1/2 VUs, 19 complete and 0 interrupted iterations
hit_probe   [  78% ] 1 VUs  0m17.0s/5m0s  18/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m18.0s), 1/2 VUs, 20 complete and 0 interrupted iterations
hit_probe   [  83% ] 1 VUs  0m18.0s/5m0s  19/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m19.0s), 1/2 VUs, 21 complete and 0 interrupted iterations
hit_probe   [  87% ] 1 VUs  0m19.0s/5m0s  20/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m20.0s), 1/2 VUs, 22 complete and 0 interrupted iterations
hit_probe   [  91% ] 1 VUs  0m20.0s/5m0s  21/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters

running (0m21.0s), 1/2 VUs, 23 complete and 0 interrupted iterations
hit_probe   [  96% ] 1 VUs  0m21.0s/5m0s  22/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters


  █ THRESHOLDS 

    cache_hit_rate
    ✓ 'rate>=0.0' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    prefix_match_rate
    ✓ 'rate>=0.95' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 24      1.122906/s
    checks_succeeded...: 100.00% 24 out of 24
    checks_failed......: 0.00%   0 out of 24

    ✓ warmup 200
    ✓ probe 200

    CUSTOM
    cache_hit_prompt_ms............: avg=98.01ms  min=95.21ms  med=97.67ms  p(95)=102.38ms max=103.68ms
    cache_hit_rate.................: 100.00% 23 out of 23
    cache_miss_prompt_ms...........: avg=454.15ms min=454.15ms med=454.15ms p(95)=454.15ms max=454.15ms
    cache_n_tokens.................: avg=3.833333 min=0        med=4        p(95)=4        max=4       
    prefix_match_rate..............: 100.00% 23 out of 23
    requests_ok....................: 24      1.122906/s

    HTTP
    http_req_duration..............: avg=841.95ms min=765.92ms med=780.06ms p(95)=1.08s    max=1.92s   
      { expected_response:true }...: avg=841.95ms min=765.92ms med=780.06ms p(95)=1.08s    max=1.92s   
    http_req_failed................: 0.00%   0 out of 24
    http_reqs......................: 24      1.122906/s

    EXECUTION
    iteration_duration.............: avg=946.46ms min=866.45ms med=880.13ms p(95)=1.27s    max=2.02s   
    iterations.....................: 24      1.122906/s
    vus............................: 1       min=1        max=2
    vus_max........................: 2       min=2        max=2

    NETWORK
    data_received..................: 43 kB   2.0 kB/s
    data_sent......................: 6.1 kB  288 B/s



running (0m21.4s), 0/2 VUs, 24 complete and 0 interrupted iterations
hit_probe ✓ [ 100% ] 1 VUs  0m21.4s/5m0s  23/23 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m01.3s/2m0s  1/1 shared iters